"""
Задания по командной строке linux
"""
"""
1) Какая комбинация клавиш используется для открытия терминала в Linux?
"""
# CTRL + ALT + T
"""
2) Перейдите в свою домашнюю директорию
"""
c
"""
3) Создайте папку под названием codify
"""
# писать код здесь
"""
4) Создайте внутри папки codify 3 папки c названиями: week1, week2, week3
"""
# писать код здесь
"""
5) Перейдите в папку week1 и создайте файл test.txt (одной командой)
"""
# писать код здесь
"""
6) Напишите внутри файла test.txt предложение Hello world!
"""
# писать код здесь
"""
7) Выведите содержимое файла test.txt на стандартное устройство вывода.
"""
# писать код здесь
"""
😍 Перейдите в домашнюю папку.
"""
# писать код здесь
"""
9) Перейдите в папку week1 находясь в домашней папке.
"""
# писать код здесь
"""
10) Создайте внутри папки week1 три файла под названием test1.txt, test2.txt, test3.txt
"""
# писать код здесь
"""
11) Скопируйте содержимое файла test.txt и скопируйте в файл под названием test1.txt
"""
# писать код здесь
"""
12) Удалите файл test1.txt
"""
# писать код здесь
"""
13) Переместите файл test.txt в папку week2
"""
# писать код здесь
"""
14) Удалите папку week1 с содержимым
"""
# писать код здесь
"""
15) Перейдите в домашнюю папку по абсолютному пути (не используя ~)
"""
# писать код здесь
"""
16) Введите команду, чтобы узнать путь до текущей директории
"""
# писать код здесь